src/main/test/supply-chain/3-Calculation/0-Apply Tax/7-Calculation Level/0-TC02.02.03_31_TaxDecisionSet.LegalTaxCalculationLevel/8-ST_PTE_TC02.02.03_31_TaxDecisionSet.LegalTaxCalculationLevel = L__FixedPrice/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
         <arg0>
            <DocumentId>
               <SystemSourceId>ICI001</SystemSourceId>
               <TransactionId/>
            </DocumentId>
            <AlternateDocumentId>
               <CustomField1>CUSTOM_01</CustomField1>
               <CustomField2/>
               <CustomField3/>
               <CustomField4/>
               <CustomField5/>
               <CustomField6/>
               <CustomField7/>
               <CustomField8/>
               <CustomField9/>
               <CustomField10/>
            </AlternateDocumentId>
            <InvoiceLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </InvoiceLanguage>
            <CommunicationLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </CommunicationLanguage>
  
            <PriceType>fixed</PriceType>
            <CalculationDecimalPlaces>2</CalculationDecimalPlaces>
            <PreviousInvoiceTaxCountry/>
            <TaxDecisionSet>
               <TaxDecisionSetId/>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation/>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </SellerTaxIndicator>
               <SellerTaxCountry/>
               <SellerTaxState/>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation/>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </BuyerTaxIndicator>
               <BuyerTaxCountry/>
               <BuyerTaxState/>
               <CombinedTaxIndicator/>
               <CommercialIndicator/>
               <SellerTaxRegCountry/>
               <SellerTaxRegState/>
               <BuyerTaxRegCountry/>
               <BuyerTaxRegState/>
     		        <GrossPriceCountry/>

               <TaxComment>
                  <TaxCommentType/>
                  <TaxCommentText/>
               </TaxComment>
               <InvoiceCurrency>
                  <CurrencyCode>EUR</CurrencyCode>
                  <SellerLocalTaxCurrencyCode/>
                  <BuyerLocalTaxCurrencyCode/>
               </InvoiceCurrency>
               <LegalTaxCalculationLevel>L</LegalTaxCalculationLevel>
               <TaxInvoiceLine>
                  <LineNumber>1</LineNumber>
                  <ItemNo>1</ItemNo>
                  <ItemType/>
                  <UNSPSC>56000000</UNSPSC>
                  <Classification/>
                  <SubClassification/>
                  <CountryItemClassification/>
                  <GrossAmount>12.4046</GrossAmount>
               </TaxInvoiceLine>
               <TaxInvoiceLine>
                  <LineNumber>2</LineNumber>
                  <ItemNo>1</ItemNo>
                  <ItemType/>
                  <UNSPSC>56000000</UNSPSC>
                  <Classification/>
                  <SubClassification/>
                  <CountryItemClassification/>
                  <GrossAmount>12.42049</GrossAmount>
               </TaxInvoiceLine>
            </TaxDecisionSet>
            <TaxDate>
               <TaxAlgorithmDate>2014-01-12</TaxAlgorithmDate>
               <TaxCalculationDate/>
            </TaxDate>
            <TaxModuleBehaviour>
               <SkipCalculation>N</SkipCalculation>
               <SkipDecision>N</SkipDecision>
            </TaxModuleBehaviour>
            <VariableTaxSteeringInput>
               <ConsignorCountry>ES</ConsignorCountry>
               <ConsignorState>ESTF</ConsignorState>
               <ConsignorBusinessUnitCode>7008</ConsignorBusinessUnitCode>
               <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
               <ConsigneeCountry>ES</ConsigneeCountry>
               <ConsigneeState>ESM</ConsigneeState>
               <ConsigneeBusinessUnitCode>2610</ConsigneeBusinessUnitCode>
               <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
               <CarrierCountry/>
               <CarrierState/>
               <CarrierBusinessUnitCode/>
               <CarrierBusinessUnitType/>
               <ShipmentStartCountry/>
               <ShipmentEndCountry/>
               <ShipmentStartState/>
               <ShipmentEndState/>
               <ServiceRenderedCountry/>
               <ServiceRenderedState/>
               <ResalePurpose/>
               <IsOutBonded/>
               <IsInBonded/>
               <TaxPreAlgorithmOutput>
                  <IsExport>N</IsExport>
                  <IsImport>N</IsImport>
                  <IsExported>N</IsExported>
                  <IsImported>N</IsImported>
               </TaxPreAlgorithmOutput>
               <ShippingOfCustomsClearedGoods/>
            </VariableTaxSteeringInput>
            <BuyerParty>
               <Party>
                  <BusinessUnitCode>2610</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName>RETAIL CENTERS MANAGEMENT</BusinessUnitName>
                  <PartyAddress>
                     <AddressType/>
                     <City/>
                     <PostBox/>
                     <Street/>
                     <ZipCode/>
                     <CountryCode>ES</CountryCode>
                     <StateCode>ESM</StateCode>
                     <CountryOfLegalRegistration/>
                  </PartyAddress>
               </Party>
               <CustomerID/>
            </BuyerParty>
            <SellerParty>
               <Party>
                  <BusinessUnitCode>7008</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName>IKEA STIFTUNG</BusinessUnitName>
     
                  <PartyAddress>
                     <AddressType/>
                     <City/>
                     <PostBox/>
                     <Street/>
                     <ZipCode/>
                     <CountryCode/>
                     <StateCode/>
                     <CountryOfLegalRegistration/>
                  </PartyAddress>
               </Party>
   
            </SellerParty>
            <TermOfDelivery>DDU</TermOfDelivery>
         </arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>